maxgerhardt/pio-dslite-extended/common/targetdb/Modules/C2000/f2837xd_dev_cfg_regs.xml
<module id="DEV_CFG_REGS" HW_revision="" description="DEV CFG Registers">
	<register id="DEVCFGLOCK1" width="32" page="1" offset="0x0" internal="0" description="Lock bit for CPUSELx registers">
		<bitfield id="CPUSEL0" description="Lock bit for CPUSEL0 register" begin="0" end="0" width="1" rwaccess="R/SOnce"/>
		<bitfield id="CPUSEL1" description="Lock bit for CPUSEL1 register" begin="1" end="1" width="1" rwaccess="R/SOnce"/>
		<bitfield id="CPUSEL2" description="Lock bit for CPUSEL2 register" begin="2" end="2" width="1" rwaccess="R/SOnce"/>
		<bitfield id="CPUSEL3" description="Lock bit for CPUSEL3 register" begin="3" end="3" width="1" rwaccess="R/SOnce"/>
		<bitfield id="CPUSEL4" description="Lock bit for CPUSEL4 register" begin="4" end="4" width="1" rwaccess="R/SOnce"/>
		<bitfield id="CPUSEL5" description="Lock bit for CPUSEL5 register" begin="5" end="5" width="1" rwaccess="R/SOnce"/>
		<bitfield id="CPUSEL6" description="Lock bit for CPUSEL6 register" begin="6" end="6" width="1" rwaccess="R/SOnce"/>
		<bitfield id="CPUSEL7" description="Lock bit for CPUSEL7 register" begin="7" end="7" width="1" rwaccess="R/SOnce"/>
		<bitfield id="CPUSEL8" description="Lock bit for CPUSEL8 register" begin="8" end="8" width="1" rwaccess="R/SOnce"/>
		<bitfield id="CPUSEL9" description="Lock bit for CPUSEL9 register" begin="9" end="9" width="1" rwaccess="R/SOnce"/>
		<bitfield id="CPUSEL10" description="Lock bit for CPUSEL10 register" begin="10" end="10" width="1" rwaccess="R/SOnce"/>
		<bitfield id="CPUSEL11" description="Lock bit for CPUSEL11 register" begin="11" end="11" width="1" rwaccess="R/SOnce"/>
		<bitfield id="CPUSEL12" description="Lock bit for CPUSEL12 register" begin="12" end="12" width="1" rwaccess="R/SOnce"/>
		<bitfield id="CPUSEL13" description="Lock bit for CPUSEL13 register" begin="13" end="13" width="1" rwaccess="R/SOnce"/>
		<bitfield id="CPUSEL14" description="Lock bit for CPUSEL14 register" begin="14" end="14" width="1" rwaccess="R/SOnce"/>
	</register>
	<register id="PARTIDL_1" width="32" page="1" offset="0x8" internal="0" description="Lower 32-bit of Device PART Identification Number">
		<bitfield id="QUAL" description="Qualification Status" begin="7" end="6" width="2" rwaccess="R/WOnce"/>
		<bitfield id="PIN_COUNT" description="Device Pin Count" begin="10" end="8" width="3" rwaccess="R/WOnce"/>
		<bitfield id="INSTASPIN" description="Motorware feature set" begin="14" end="13" width="2" rwaccess="R/WOnce"/>
		<bitfield id="FLASH_SIZE" description="Flash size in KB" begin="23" end="16" width="8" rwaccess="R/WOnce"/>
		<bitfield id="PARTID_FORMAT_REVISION" description="Revision of the PARTID format" begin="31" end="28" width="4" rwaccess="R/WOnce"/>
	</register>
	<register id="PARTIDH_1" width="32" page="1" offset="0xa" internal="0" description="Upper 32-bit of Device PART Identification Number">
		<bitfield id="FAMILY" description="Device family" begin="15" end="8" width="8" rwaccess="R/WOnce"/>
		<bitfield id="PARTNO" description="Device part number" begin="23" end="16" width="8" rwaccess="R/WOnce"/>
		<bitfield id="DEVICE_CLASS_ID" description="Device class ID" begin="31" end="24" width="8" rwaccess="R/WOnce"/>
	</register>
	<register id="REVID" width="32" page="1" offset="0xc" internal="0" description="Device Revision Number">
		<bitfield id="REVID" description="Device Revision ID" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="DC0_1" width="32" page="1" offset="0x10" internal="0" description="Device Capability: Device Information">
		<bitfield id="SINGLE_CORE" description="Single Core vs Dual Core " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC1_1" width="32" page="1" offset="0x12" internal="0" description="Device Capability: Processing Block Customization">
		<bitfield id="CPU1_FPU_TMU" description="CPU1's FPU1+TMU1 " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="CPU2_FPU_TMU" description="CPU2's FPU2+TMU2 " begin="1" end="1" width="1" rwaccess="R/WOnce"/>
		<bitfield id="CPU1_VCU" description="CPU1's VCU " begin="2" end="2" width="1" rwaccess="R/WOnce"/>
		<bitfield id="CPU2_VCU" description="CPU2's VCU " begin="3" end="3" width="1" rwaccess="R/WOnce"/>
		<bitfield id="CPU1_CLA1" description="CPU1.CLA1 " begin="6" end="6" width="1" rwaccess="R/WOnce"/>
		<bitfield id="CPU2_CLA1" description="CPU2.CLA1 " begin="8" end="8" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC2_1" width="32" page="1" offset="0x14" internal="0" description="Device Capability: EMIF Customization">
		<bitfield id="EMIF1" description="EMIF1 " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="EMIF2" description="EMIF2 " begin="1" end="1" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC3_1" width="32" page="1" offset="0x16" internal="0" description="Device Capability: Peripheral Customization">
		<bitfield id="EPWM1" description="EPWM1 " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="EPWM2" description="EPWM2 " begin="1" end="1" width="1" rwaccess="R/WOnce"/>
		<bitfield id="EPWM3" description="EPWM3 " begin="2" end="2" width="1" rwaccess="R/WOnce"/>
		<bitfield id="EPWM4" description="EPWM4 " begin="3" end="3" width="1" rwaccess="R/WOnce"/>
		<bitfield id="EPWM5" description="EPWM5 " begin="4" end="4" width="1" rwaccess="R/WOnce"/>
		<bitfield id="EPWM6" description="EPWM6 " begin="5" end="5" width="1" rwaccess="R/WOnce"/>
		<bitfield id="EPWM7" description="EPWM7 " begin="6" end="6" width="1" rwaccess="R/WOnce"/>
		<bitfield id="EPWM8" description="EPWM8 " begin="7" end="7" width="1" rwaccess="R/WOnce"/>
		<bitfield id="EPWM9" description="EPWM9 " begin="8" end="8" width="1" rwaccess="R/WOnce"/>
		<bitfield id="EPWM10" description="EPWM10 " begin="9" end="9" width="1" rwaccess="R/WOnce"/>
		<bitfield id="EPWM11" description="EPWM11 " begin="10" end="10" width="1" rwaccess="R/WOnce"/>
		<bitfield id="EPWM12" description="EPWM12 " begin="11" end="11" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC4_1" width="32" page="1" offset="0x18" internal="0" description="Device Capability: Peripheral Customization">
		<bitfield id="ECAP1" description="ECAP1 " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="ECAP2" description="ECAP2 " begin="1" end="1" width="1" rwaccess="R/WOnce"/>
		<bitfield id="ECAP3" description="ECAP3 " begin="2" end="2" width="1" rwaccess="R/WOnce"/>
		<bitfield id="ECAP4" description="ECAP4 " begin="3" end="3" width="1" rwaccess="R/WOnce"/>
		<bitfield id="ECAP5" description="ECAP5 " begin="4" end="4" width="1" rwaccess="R/WOnce"/>
		<bitfield id="ECAP6" description="ECAP6 " begin="5" end="5" width="1" rwaccess="R/WOnce"/>
	</register>
