maxgerhardt/pio-dslite-extended/common/targetdb/Modules/C2000/f2837xd_dev_cfg_regs.xml
	<register id="DC5_1" width="32" page="1" offset="0x1a" internal="0" description="Device Capability: Peripheral Customization">
		<bitfield id="EQEP1" description="EQEP1 " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="EQEP2" description="EQEP2 " begin="1" end="1" width="1" rwaccess="R/WOnce"/>
		<bitfield id="EQEP3" description="EQEP3 " begin="2" end="2" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC6_1" width="32" page="1" offset="0x1c" internal="0" description="Device Capability: Peripheral Customization">
		<bitfield id="CLB1" description="CLB1" begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="CLB2" description="CLB2" begin="1" end="1" width="1" rwaccess="R/WOnce"/>
		<bitfield id="CLB3" description="CLB3" begin="2" end="2" width="1" rwaccess="R/WOnce"/>
		<bitfield id="CLB4" description="CLB4" begin="3" end="3" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC7_1" width="32" page="1" offset="0x1e" internal="0" description="Device Capability: Peripheral Customization">
		<bitfield id="SD1" description="SD1 " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="SD2" description="SD2 " begin="1" end="1" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC8_1" width="32" page="1" offset="0x20" internal="0" description="Device Capability: Peripheral Customization">
		<bitfield id="SCI_A" description="SCI_A " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="SCI_B" description="SCI_B " begin="1" end="1" width="1" rwaccess="R/WOnce"/>
		<bitfield id="SCI_C" description="SCI_C " begin="2" end="2" width="1" rwaccess="R/WOnce"/>
		<bitfield id="SCI_D" description="SCI_D " begin="3" end="3" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC9_1" width="32" page="1" offset="0x22" internal="0" description="Device Capability: Peripheral Customization">
		<bitfield id="SPI_A" description="SPI_A " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="SPI_B" description="SPI_B " begin="1" end="1" width="1" rwaccess="R/WOnce"/>
		<bitfield id="SPI_C" description="SPI_C " begin="2" end="2" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC10_1" width="32" page="1" offset="0x24" internal="0" description="Device Capability: Peripheral Customization">
		<bitfield id="I2C_A" description="I2C_A " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="I2C_B" description="I2C_B " begin="1" end="1" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC11_1" width="32" page="1" offset="0x26" internal="0" description="Device Capability: Peripheral Customization">
		<bitfield id="CAN_A" description="CAN_A " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="CAN_B" description="CAN_B " begin="1" end="1" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC12_1" width="32" page="1" offset="0x28" internal="0" description="Device Capability: Peripheral Customization">
		<bitfield id="McBSP_A" description="McBSP_A " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="McBSP_B" description="McBSP_B " begin="1" end="1" width="1" rwaccess="R/WOnce"/>
		<bitfield id="USB_A" description="Decides the capability of the USB_A Module" begin="17" end="16" width="2" rwaccess="R/WOnce"/>
	</register>
	<register id="DC13_1" width="32" page="1" offset="0x2a" internal="0" description="Device Capability: Peripheral Customization">
		<bitfield id="uPP_A" description="uPP_A " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC14_1" width="32" page="1" offset="0x2c" internal="0" description="Device Capability: Analog Modules Customization">
		<bitfield id="ADC_A" description="ADC_A" begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="ADC_B" description="ADC_B" begin="1" end="1" width="1" rwaccess="R/WOnce"/>
		<bitfield id="ADC_C" description="ADC_C" begin="2" end="2" width="1" rwaccess="R/WOnce"/>
		<bitfield id="ADC_D" description="ADC_D" begin="3" end="3" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC15_1" width="32" page="1" offset="0x2e" internal="0" description="Device Capability: Analog Modules Customization">
		<bitfield id="CMPSS1" description="CMPSS1 " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="CMPSS2" description="CMPSS2 " begin="1" end="1" width="1" rwaccess="R/WOnce"/>
		<bitfield id="CMPSS3" description="CMPSS3 " begin="2" end="2" width="1" rwaccess="R/WOnce"/>
		<bitfield id="CMPSS4" description="CMPSS4 " begin="3" end="3" width="1" rwaccess="R/WOnce"/>
		<bitfield id="CMPSS5" description="CMPSS5 " begin="4" end="4" width="1" rwaccess="R/WOnce"/>
		<bitfield id="CMPSS6" description="CMPSS6 " begin="5" end="5" width="1" rwaccess="R/WOnce"/>
		<bitfield id="CMPSS7" description="CMPSS7 " begin="6" end="6" width="1" rwaccess="R/WOnce"/>
		<bitfield id="CMPSS8" description="CMPSS8 " begin="7" end="7" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC17_1" width="32" page="1" offset="0x32" internal="0" description="Device Capability: Analog Modules Customization">
		<bitfield id="DAC_A" description="Buffered-DAC_A" begin="16" end="16" width="1" rwaccess="R/WOnce"/>
		<bitfield id="DAC_B" description="Buffered-DAC_B" begin="17" end="17" width="1" rwaccess="R/WOnce"/>
		<bitfield id="DAC_C" description="Buffered-DAC_C" begin="18" end="18" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC18_1" width="32" page="1" offset="0x34" internal="0" description="Device Capability: CPU1 Lx SRAM Customization">
		<bitfield id="LS0_1" description="LS0_1 " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="LS1_1" description="LS1_1 " begin="1" end="1" width="1" rwaccess="R/WOnce"/>
		<bitfield id="LS2_1" description="LS2_1 " begin="2" end="2" width="1" rwaccess="R/WOnce"/>
		<bitfield id="LS3_1" description="LS3_1 " begin="3" end="3" width="1" rwaccess="R/WOnce"/>
		<bitfield id="LS4_1" description="LS4_1 " begin="4" end="4" width="1" rwaccess="R/WOnce"/>
		<bitfield id="LS5_1" description="LS5_1 " begin="5" end="5" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC19_1" width="32" page="1" offset="0x36" internal="0" description="Device Capability: CPU2 Lx SRAM Customization">
		<bitfield id="LS0_2" description="LS0_2 " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="LS1_2" description="LS1_2 " begin="1" end="1" width="1" rwaccess="R/WOnce"/>
		<bitfield id="LS2_2" description="LS2_2 " begin="2" end="2" width="1" rwaccess="R/WOnce"/>
		<bitfield id="LS3_2" description="LS3_2 " begin="3" end="3" width="1" rwaccess="R/WOnce"/>
		<bitfield id="LS4_2" description="LS4_2 " begin="4" end="4" width="1" rwaccess="R/WOnce"/>
		<bitfield id="LS5_2" description="LS5_2 " begin="5" end="5" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="DC20_1" width="32" page="1" offset="0x38" internal="0" description="Device Capability: GSx SRAM Customization">
		<bitfield id="GS0" description="GS0 " begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GS1" description="GS1 " begin="1" end="1" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GS2" description="GS2 " begin="2" end="2" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GS3" description="GS3 " begin="3" end="3" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GS4" description="GS4 " begin="4" end="4" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GS5" description="GS5 " begin="5" end="5" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GS6" description="GS6 " begin="6" end="6" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GS7" description="GS7 " begin="7" end="7" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GS8" description="GS8 " begin="8" end="8" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GS9" description="GS9 " begin="9" end="9" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GS10" description="GS10 " begin="10" end="10" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GS11" description="GS11 " begin="11" end="11" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GS12" description="GS12 " begin="12" end="12" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GS13" description="GS13 " begin="13" end="13" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GS14" description="GS14 " begin="14" end="14" width="1" rwaccess="R/WOnce"/>
		<bitfield id="GS15" description="GS15 " begin="15" end="15" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="PERCNF1_1" width="32" page="1" offset="0x60" internal="0" description="Peripheral Configuration register">
		<bitfield id="ADC_A_MODE" description="ADC_A mode setting bit" begin="0" end="0" width="1" rwaccess="R/WOnce"/>
		<bitfield id="ADC_B_MODE" description="ADC_B mode setting bit" begin="1" end="1" width="1" rwaccess="R/WOnce"/>
		<bitfield id="ADC_C_MODE" description="ADC_C mode setting bit" begin="2" end="2" width="1" rwaccess="R/WOnce"/>
		<bitfield id="ADC_D_MODE" description="ADC_D mode setting bit" begin="3" end="3" width="1" rwaccess="R/WOnce"/>
		<bitfield id="USB_A_PHY" description="USB_A_PHY " begin="16" end="16" width="1" rwaccess="R/WOnce"/>
	</register>
	<register id="FUSEERR" width="32" page="1" offset="0x74" internal="0" description="e-Fuse error Status register">
		<bitfield id="ALERR" description="Efuse Autoload Error Status" begin="4" end="0" width="5" rwaccess="R"/>
		<bitfield id="ERR" description="Efuse Self Test Error Status" begin="5" end="5" width="1" rwaccess="R"/>
	</register>
	<register id="SOFTPRES0" width="32" page="1" offset="0x82" internal="0" description="Processing Block Software Reset register">
		<bitfield id="CPU1_CLA1" description="CPU1_CLA1 software reset bit" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="CPU2_CLA1" description="CPU2_CLA1 software reset bit" begin="2" end="2" width="1" rwaccess="R/W"/>
	</register>
